import "../css/AboutUs.css";

export function AboutUs() {
  return (
    <>
      <div
        style={{ paddingTop: "35vh" }}
        className="container"
      >
        <div className="about_us_flex">
          <h2><span style={{color:"#45FB78"}}>Детальніше</span> про нас</h2>
        </div>
        <div className="about_us_block" style={{ paddingTop: "5vh" }}>
          <p style={{ marginLeft: "20px" }}>
            Ми спеціалізуємося на встановленні та обслуговуванні
            енергетичних, теплових і вентиляційних систем. Працюємо з приватними
            та комерційними об’єктами, забезпечуючи надійні, ефективні й сучасні
            рішення.
          </p>
          <p style={{ marginRight: "20px" }}>
            Наша команда професіоналів реалізує проєкти в Запоріжжі та області,
            гарантуючи високу якість, точність виконання та відповідність усім
            технічним стандартам. Ми прагнемо до інновацій і комфорту наших
            клієнтів, створюючи оптимальні інженерні рішення для кожного
            об’єкта.
          </p>
        </div>
      </div>
    </>
  );
}
